#include <iostream>

using namespace std;

int main()

{
setlocale(LC_ALL, "Russian");

	//==========================================================================//
	//===================================DZ1====================================//
	//==========================================================================//
	/*
	Написать программу, проверяющую что сумма двух (введенных с клавиатуры)
	чисел лежит в пределах от 10 до 20 (включительно), если да – вывести строку
	"true", в противном случае – "false";*/
	cout << "//====================================[DZ1]====================================//\n\n";
	{
		cout << "Введите значения (A) и (B) \n\n";
		int A, B, C;
		cout << " A = ";
		cin >> A;
		cout << " B = ";
		cin >> B;
		C = A + B;
		cout << endl;
		
		if ((C < 10) && (C != 10) || (C > 20) && (C != 20)) 
		{
			cout << " false";
		}
		else
		{
			cout << " true";
		}
	}

	//==========================================================================//
	//===================================DZ2====================================//
	//==========================================================================//
	/*
	Написать программу, выводящую на экран строку “true”,
	если две целочисленные константы, объявленные в её начале либо
	обе равны десяти сами по себе, либо их сумма равна десяти. Иначе "false".
	*/
	cout << "\n\n//====================================[DZ2]====================================//\n\n";
	{
		const int a = 5;
		const int b = 5;
		
			if ((a == 10 && b == 10) || (a + b ==10))
			{	
				cout << " true";
			}
			else
			{
				cout << " false";
			}
	}
	
	//==========================================================================//
	//=================================DZ3======================================//
	//==========================================================================//
	/*
	Написать программу которая выводит на экран список всех нечетных чисел от 1 до 50.
	Например: "Your numbers: 1 3 5 7 9 11 13 …". Для решения используйте любой С++ цикл.
	*/
	cout << "\n\n//====================================[DZ3]====================================//\n\n";
	{
		cout << " Ваши числа: ";
		int a = 1;
		do {
			if (a % 2 != 0) {
				cout << a << ", ";
			}
			a++;
		} while (a <= 50);
	}

	//==========================================================================//
	//=================================DZ4======================================//
	//==========================================================================//
	/*
	Написать программу, проверяющую, является ли некоторое число - простым.
	Простое число — это целое положительное число,
	которое делится без остатка только на единицу и себя само.
	*/
	cout << "\n\n//====================================[DZ4]====================================//\n\n";
	{
		bool prime_number = true;
		int a;
		cout << " Введите число ";
		cin >> a;

		for (int b = 2; b <= a / 2; b++)
		{
			if (a % b == 0)
			{
				prime_number = false;
				break;
			}
		}

		if ((prime_number) && (a > 1)) cout << " Введённое число (" << a << ") является простым";
		else cout << " Введённое число (" << a << ") является сложным";
	}

	//==========================================================================//
	//=================================DZ5======================================//
	//==========================================================================//
	/*
	Написать программу, проверяющую, является ли некоторое число - простым.
	Простое число — это целое положительное число,
	которое делится без остатка только на единицу и себя само.
	*/
	cout << "\n\n//====================================[DZ5]====================================//\n\n";
	rsize_t a;
	cout << " введите год [от 1 до 3000]: ";
	cin >> a;
	if (a > 0 && a <= 3000)
	{
		if ((a % 4 == 0 && a % 100 != 0) || a % 400 == 0)
		{
			cout << " Год является високосным";
		}
		else
		{
			cout << " Год является не високосным";
		}
		cout << "\n\n//====================================[END]====================================//\n\n";
	}
	return 0;
}